## Staging: s3
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
web.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                      |
|--------|--------------------------------------------------------------------------------|
| add    | `aws_s3_bucket.cra_upd_web_bucket`                                             |
|        | `aws_s3_bucket_acl.cra_upd_web_bucket_acl`                                     |
|        | `aws_s3_bucket_lifecycle_configuration.cra_upd_data_bucket_lifecycle_rule`     |
|        | `aws_s3_bucket_ownership_controls.cra_upd_web_bucket_ownership_controls`       |
|        | `aws_s3_bucket_public_access_block.cra_upd_web_bucket_access_block`            |
|        | `aws_s3_bucket_website_configuration.cra_upd_web_bucket_website_configuration` |
|        | `module.cra_upd_data_s3_bucket.aws_s3_bucket.this`                             |
|        | `module.cra_upd_data_s3_bucket.aws_s3_bucket_public_access_block.this`         |
| delete | `module.s3_bucket.aws_s3_bucket.this`                                          |
|        | `module.s3_bucket.aws_s3_bucket_public_access_block.this`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.cra_upd_web_bucket will be created
  + resource "aws_s3_bucket" "cra_upd_web_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "upd-web-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.cra_upd_web_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "cra_upd_web_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.cra_upd_data_bucket_lifecycle_rule will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "cra_upd_data_bucket_lifecycle_rule" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cra-upd-data-bucket-lifecycle-rule"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + newer_noncurrent_versions = 7
              + noncurrent_days           = 7
            }
        }
    }

  # aws_s3_bucket_ownership_controls.cra_upd_web_bucket_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "cra_upd_web_bucket_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.cra_upd_web_bucket_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "cra_upd_web_bucket_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_website_configuration.cra_upd_web_bucket_website_configuration will be created
  + resource "aws_s3_bucket_website_configuration" "cra_upd_web_bucket_website_configuration" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.cra_upd_data_s3_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cra-upd-dashboard-data-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "CraUpdDashboard"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Critical"    = "false"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.cra_upd_data_s3_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket.this will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::cra-arc-upd-tbpc-codespaces-data" -> null
      - bucket                      = "cra-arc-upd-tbpc-codespaces-data" -> null
      - bucket_domain_name          = "cra-arc-upd-tbpc-codespaces-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cra-arc-upd-tbpc-codespaces-data.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "cra-arc-upd-tbpc-codespaces-data" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre"  = "cra-arc-upd-tbpc"
          - "Critical"    = "false"
          - "Environment" = "staging"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "cra-arc-upd-tbpc"
          - "Purpose"     = "Codespaces Data"
          - "Terraform"   = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre"  = "cra-arc-upd-tbpc"
          - "Critical"    = "false"
          - "Environment" = "staging"
          - "ManagedBy"   = "Terraform"
          - "Project"     = "cra-arc-upd-tbpc"
          - "Purpose"     = "Codespaces Data"
          - "Terraform"   = "true"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "509b2e592a810ab5850053f679f52e61b552b8c6413d229fd225ee2dd60d40f8" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this will be destroyed
  # (because aws_s3_bucket_public_access_block.this is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "cra-arc-upd-tbpc-codespaces-data" -> null
      - id                      = "cra-arc-upd-tbpc-codespaces-data" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - bucket_arn        = "arn:aws:s3:::cra-arc-upd-tbpc-codespaces-data" -> null
  - bucket_name       = "cra-arc-upd-tbpc-codespaces-data" -> null
  + data_bucket_arn   = (known after apply)
  + data_bucket_name  = (known after apply)
  + web_bucket_arn    = (known after apply)
  + web_bucket_domain = (known after apply)
  + web_bucket_id     = (known after apply)

Warning: Argument is deprecated

  with module.cra_upd_data_s3_bucket.aws_s3_bucket.this,
  on .terraform/modules/cra_upd_data_s3_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.cra_upd_web_bucket"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
